Revit 2027 API
DocumentSet.Erase Method
Removes a specified object from the set.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public virtual int Erase(
	Document item
)
Public Overridable Function Erase (
	item As Document
) As Integer
public:
virtual int Erase(
	Document^ item
)
abstract Erase :
        item : Document -> int
override Erase :
        item : Document -> int
Parameters
item Document
The item to be erased.
Return Value
Int32
The number of items that were erased from the set.
See Also
Reference
DocumentSet Class
Autodesk.Revit.DB Namespace